package staff;

/*

Дана строка, найти длину ее максимальной подстроки, в которой все буквы уникальные. 

Например 
Если дано: "аааббвгдааа"
то максимальной подстрокой с уникальными буквами является: "бвгда"
программа выводит: 5

Если дано: "абвадгв"
то максимальной подстрокой с уникальными буквами является: "бвадг"
программа выводит: 5

*Программа должна быть минимальной по дополнительной памяти и времени.
 */

import org.junit.jupiter.api.Test;

public class staffTest2 {

    @Test
    public void test () {



    }


}
